const lectureMethods = [
    { title: "Классическая лекция - традиционное чтение материала в устной форме." },
    { title: "Проблемная лекция - постановка проблемы и её решение через анализ и обсуждение." },
    { title: "Лекция-беседа - диалог с аудиторией, включающий вопросы и обсуждение." },
    { title: "Лекция-визуализация - подача материала через слайды, схемы, видео." },
    { title: "Лекция-презентация - сочетание устного изложения с мультимедиа." },
    { title: "Лекция-дискуссия - активное обсуждение различных точек зрения." },
    { title: "Интерактивная лекция - выполнение заданий в группах, мини-дебаты." },
    { title: "Лекция с обратной связью - проверка понимания через тесты и опросы." },
    
];

const lectureTypes = [
    { title: "Вводная лекция - знакомство с темой, общие понятия и цели курса." },
    { title: "Обзорная лекция - краткий обзор нескольких тем или курса в целом." },
    { title: "Концентрированная лекция - глубокий разбор одной темы." },
    { title: "Лекция-объяснение - разбор сложных теоретических вопросов." },
    { title: "Лекция-консультация - ответы на вопросы, разбор проблемных тем." },
    { title: "Лекция-эксперимент - проведение демонстраций, опытов." },
    { title: "Лекция с практическими элементами - сочетание теории и выполнения заданий." },
    { title: "Лекция-гипотеза - предлагает новую концепцию и обсуждает её с аудиторией." }
];

const writingStyles = [
    { title: "Формальный" },
    { title: "Научный" },
    { title: "Разговорный" }
];

export { lectureMethods, lectureTypes, writingStyles };
